InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьЗначенияЭлементовКонструктораИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьЗначенияЭлементовКонструктораИзКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)
	
	Идентификаторы                 = ПараметрыЗагрузки.Идентификаторы;
	ЗначенияЭлементовКонструктора  = ДанныеКлассификатора.ЗначенияЭлементовКонструктора;
	ПараметрыЭлементовКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементовКонструктора();
	ПолноеИмяСправочникаЭлементов  = Метаданные.Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолноеИмя();
	ИмяТаблицыВидовПродукции       = Метаданные.Справочники.ВидыПродукцииИС.ПолноеИмя();
	ЭтоРасширеннаяВерсия           = ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС();
	СписокИсключенийБРМК           = ОбщегоНазначенияИС.СписокИсключенийПодсистемыБРМК();
	
	ЭлементыКЗаписиКомментария = Новый ТаблицаЗначений;
	ЭлементыКЗаписиКомментария.Колонки.Добавить("ЭлементКонструктора", Новый ОписаниеТипов("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС"));
	ЭлементыКЗаписиКомментария.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	
	НаборЗаписей = СоздатьНаборЗаписей();
	 
    Для Каждого ЗначениеЭлементаКонструктора Из ЗначенияЭлементовКонструктора Цикл
		СтруктураПоиска = Новый Структура;
        СтруктураПоиска.Вставить("ИмяТаблицы",   ПолноеИмяСправочникаЭлементов);
        СтруктураПоиска.Вставить("Наименование", ЗначениеЭлементаКонструктора.ЭлементКонструктора);
		
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			ЭлементКонструктораСсылка = НайденныеСтроки[0].Ссылка;
		Иначе
			Если ПараметрыЗагрузки.РежимОтладки Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Внутренняя ошибка поиска элемента конструктора %1'"),
					ЗначениеЭлементаКонструктора.ЭлементКонструктора);
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		ПараметрыЭлементаКонструктора = ПараметрыЭлементовКонструктора.Получить(ЭлементКонструктораСсылка);

        Если ЭлементКонструктораСсылка.Комментарий <> ЗначениеЭлементаКонструктора.Комментарий Тогда
			ЭлементКЗаписиКомментария = ЭлементыКЗаписиКомментария.Добавить();
			ЭлементКЗаписиКомментария.ЭлементКонструктора = ЭлементКонструктораСсылка;
			ЭлементКЗаписиКомментария.Комментарий         = ЗначениеЭлементаКонструктора.Комментарий;
        КонецЕсли;
        
        СтруктураПоиска = Новый Структура;
        СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицыВидовПродукции);
        СтруктураПоиска.Вставить("Идентификатор", ЗначениеЭлементаКонструктора.ВидПродукцииИдентификатор);
        СтруктураПоиска.Вставить("Наименование",  ЗначениеЭлементаКонструктора.ВидПродукцииНаименование);
        
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);

		Если НайденныеСтроки.Количество() Тогда
			ВидПродукцииСсылка = НайденныеСтроки[0].Ссылка;
		Иначе
			РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ВидПродукцииСсылка) Тогда
			РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
			Продолжить;
		КонецЕсли;

		ЗначениеИзКлассификатора = ЗначениеЭлементаКонструктораИзКлассификатора(ЗначениеЭлементаКонструктора.ТипЗначения,
			ЗначениеЭлементаКонструктора.Значение, ЗначениеЭлементаКонструктора.НаименованиеЗначения,
			ЗначениеЭлементаКонструктора.ИдентификаторЗначения, ЗначениеЭлементаКонструктора.КлючЗначения, Идентификаторы);
        
        Если ЗначениеЗаполнено(ЗначениеЭлементаКонструктора.Значение) И ЗначениеИзКлассификатора = Неопределено Тогда
			Если ПараметрыЗагрузки.РежимОтладки Тогда
				ВызватьИсключение СтрШаблон(НСтр(
					"ru = 'Внутренняя ошибка поиска значения элемента конструктора с типом %1 и значением %2'"),
					ЗначениеЭлементаКонструктора.ТипЗначения, ЗначениеЭлементаКонструктора.Значение);
			Иначе
				Если ЭтоРасширеннаяВерсия Тогда
					РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				ИначеЕсли СписокИсключенийБРМК.Найти(ЗначениеЭлементаКонструктора.ТипЗначения) = Неопределено Тогда
					РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
        	
        НоваяЗапись = НаборЗаписей.Добавить();
        
        НоваяЗапись.ЭлементКонструктора = ЭлементКонструктораСсылка;
        НоваяЗапись.ВидПродукции        = ВидПродукцииСсылка;
        НоваяЗапись.Значение            = ЗначениеИзКлассификатора;
        
        Если ПараметрыЭлементаКонструктора.ИспользоватьАтрибуты И ЗначениеЭлементаКонструктора.Атрибуты.Количество() > 0 Тогда
			СтруктураАтрибута = Новый Структура;

			Для Каждого СтрокаАтрибута Из ЗначениеЭлементаКонструктора.Атрибуты Цикл
				ЗначениеАтрибута = ЗначениеЭлементаКонструктораИзКлассификатора(СтрокаАтрибута.ТипЗначения,
					СтрокаАтрибута.Значение, СтрокаАтрибута.НаименованиеЗначения, СтрокаАтрибута.ИдентификаторЗначения,
					СтрокаАтрибута.КлючЗначения, Идентификаторы);

				Если ЗначениеЗаполнено(СтрокаАтрибута.Значение) И ЗначениеАтрибута = Неопределено Тогда
					Если ПараметрыЗагрузки.РежимОтладки Тогда
						ВызватьИсключение СтрШаблон(НСтр("ru = 'Внутренняя ошибка поиска значения атрибута с типом %1 и значением %2'"),
							СтрокаАтрибута.ТипЗначения, СтрокаАтрибута.Значение);
					Иначе
						РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
						Продолжить;
					КонецЕсли;
				КонецЕсли;

				СтруктураАтрибута.Вставить(СтрокаАтрибута.Атрибут, ЗначениеАтрибута);

			КонецЦикла;

			НоваяЗапись.Атрибуты = Новый ХранилищеЗначения(СтруктураАтрибута);

		КонецЕсли;
        
	КонецЦикла;
    
    НаборЗаписей.Записать();
    
    Если ЭлементыКЗаписиКомментария.Количество() Тогда
		ЭлементыКЗаписиКомментария.Свернуть("ЭлементКонструктора, Комментарий");
		
		Для каждого ЭлементКонструктора Из ЭлементыКЗаписиКомментария Цикл
			ОбъектЭлементКонструктора = ЭлементКонструктораСсылка.ПолучитьОбъект();
			ОбъектЭлементКонструктора.Комментарий = ЭлементКонструктора.Комментарий;
			ОбъектЭлементКонструктора.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗначениеЭлементаКонструктораИзКлассификатора(ТипЗначения, ЗначениеЭлемента, НаименованиеЗначения, ИдентификаторЗначения, 
		КлючЗначения, ТаблицаИдентификаторов=Неопределено) Экспорт
	
	ЗначениеЭлементаИБ = Неопределено;
	
	Если ЗначениеЗаполнено(ТипЗначения) И ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТипЗначения);

		Если ОбъектМетаданных <> Неопределено Тогда
			Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ИмяТаблицы", ТипЗначения);
				
				Если ТипЗначения = "Справочник.ШаблоныКодовМаркировкиСУЗ" Тогда
					СтруктураПоиска.Вставить("КлючЗначения", КлючЗначения);
				Иначе
					СтруктураПоиска.Вставить("Идентификатор", ИдентификаторЗначения);
					СтруктураПоиска.Вставить("Наименование", НаименованиеЗначения);
				КонецЕсли;

				НайденныеСтроки = ТаблицаИдентификаторов.НайтиСтроки(СтруктураПоиска);

				Если НайденныеСтроки.Количество() Тогда
					ЗначениеЭлементаИБ = НайденныеСтроки[0].Ссылка;
				КонецЕсли;

			Иначе
				Попытка
					ЗначениеЭлементаИБ = Перечисления[ОбъектМетаданных.Имя][ЗначениеЭлемента];
				Исключение
					Возврат ЗначениеЭлементаИБ;
				КонецПопытки;

			КонецЕсли;

		Иначе
			Если ТипЗначения = "Дата" Тогда
				ЗначениеЭлементаИБ = ПрочитатьДатуJSON(ЗначениеЭлемента, ФорматДатыJSON.ISO);
			ИначеЕсли ТипЗначения = "Число" Или ТипЗначения = "Строка" Или ТипЗначения = "Булево" Тогда
				ЗначениеЭлементаИБ = ЗначениеЭлемента;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
			
	Возврат ЗначениеЭлементаИБ;
	
КонецФункции

// Инициализирует таблицу данных для записи в ИБ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными для записи в регистр сведений:
//    * ЭлементКонструктора - СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС - элемент конструктора видов продукции.
//    * ВидПродукции - СправочникСсылка.ВидыПродукцииИС - вид продукции.
//    * Значение - ОпределяемыйТип.ЗначениеЭлементаКонструктораВидовПродукцииИС - значение элемента конструктора.
//    * ЗначениеУстановлено - Булево - признак того, что значение установлено.
//    * ОчиститьАтрибуты - Булево - признак того, что требуется записать аналогичное значение пользователя, но без атрибутов.
//    * Параметризуется - Булево - признак того, что элемент конструктора параметризуется.
//    * КаждомуВидуПродукцииСоответствуетОдноЗначение - Булево - признак того, что каждому виду продукции соответствует одно значение.
//
Функция ИнициализироватьТаблицуДанных() Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ЭлементКонструктора", Новый ОписаниеТипов("СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС"));
	Таблица.Колонки.Добавить("ВидПродукции",        Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	Таблица.Колонки.Добавить("Значение",            Метаданные.ОпределяемыеТипы.ЗначениеЭлементаКонструктораВидовПродукцииИС.Тип);
	Таблица.Колонки.Добавить("ЗначениеУстановлено", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ОчиститьАтрибуты",    Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Параметризуется",     Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("КаждомуВидуПродукцииСоответствуетОдноЗначение", Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции

// Записывает данные в регистр
//
// Параметры:
//  Таблица - см. ИнициализироватьТаблицуДанных
//
Процедура ЗаписатьДанные(Таблица) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС");
		ЭлементБлокировки.ИсточникДанных = Таблица;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЭлементКонструктора", "ЭлементКонструктора");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ВидПродукции",        "ВидПродукции");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.ЭлементКонструктора КАК ЭлементКонструктора,
		|	Таблица.ВидПродукции КАК ВидПродукции,
		|	Таблица.Значение КАК Значение,
		|	Таблица.ЗначениеУстановлено КАК ЗначениеУстановлено,
		|	Таблица.ОчиститьАтрибуты КАК ОчиститьАтрибуты,
		|	Таблица.Параметризуется КАК Параметризуется,
		|	Таблица.КаждомуВидуПродукцииСоответствуетОдноЗначение КАК КаждомуВидуПродукцииСоответствуетОдноЗначение
		|ПОМЕСТИТЬ Таблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.ЭлементКонструктора КАК ЭлементКонструктора,
		|	Таблица.ВидПродукции КАК ВидПродукции,
		|	Таблица.Значение КАК Значение,
		|	Таблица.ЗначениеУстановлено КАК ЗначениеУстановлено,
		|	Таблица.ОчиститьАтрибуты КАК ОчиститьАтрибуты,
		|	Таблица.Параметризуется КАК Параметризуется,
		|	Таблица.КаждомуВидуПродукцииСоответствуетОдноЗначение КАК КаждомуВидуПродукцииСоответствуетОдноЗначение,
		|	МАКСИМУМ(НЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL) КАК ЕстьЗначение,
		|	МАКСИМУМ(НЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL) КАК ЕстьЗначениеПользователя,
		|	МАКСИМУМ(ЗначенияЭлементовКонструктора.Значение) КАК ТекущееЗначениеЭлемента
		|ИЗ
		|	Таблица КАК Таблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
		|		ПО Таблица.ЭлементКонструктора = ЗначенияЭлементовКонструктора.ЭлементКонструктора
		|		И Таблица.ВидПродукции = ЗначенияЭлементовКонструктора.ВидПродукции
		|		И ВЫБОР
		|			КОГДА НЕ Таблица.Параметризуется
		|			ИЛИ Таблица.КаждомуВидуПродукцииСоответствуетОдноЗначение
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Таблица.Значение = ЗначенияЭлементовКонструктора.Значение
		|		КОНЕЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК
		|			ЗначенияПользователяЭлементовКонструктора
		|		ПО Таблица.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
		|		И Таблица.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
		|		И ВЫБОР
		|			КОГДА НЕ Таблица.Параметризуется
		|			ИЛИ Таблица.КаждомуВидуПродукцииСоответствуетОдноЗначение
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Таблица.Значение = ЗначенияПользователяЭлементовКонструктора.Значение
		|		КОНЕЦ
		|СГРУППИРОВАТЬ ПО
		|	Таблица.ЭлементКонструктора,
		|	Таблица.ВидПродукции,
		|	Таблица.Значение,
		|	Таблица.ЗначениеУстановлено,
		|	Таблица.ОчиститьАтрибуты,
		|	Таблица.Параметризуется,
		|	Таблица.КаждомуВидуПродукцииСоответствуетОдноЗначение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначениеУстановлено";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеЗаписи = Новый Структура;
			ДанныеЗаписи.Вставить("Значение",            Выборка.Значение);
			ДанныеЗаписи.Вставить("ПометкаУдаления",     Ложь);
			ДанныеЗаписи.Вставить("Режим",               Неопределено);
			Если Выборка.ЗначениеУстановлено Тогда
				Если Выборка.КаждомуВидуПродукцииСоответствуетОдноЗначение Тогда
					Если Выборка.ТекущееЗначениеЭлемента = Выборка.Значение
						И Выборка.ЕстьЗначениеПользователя Тогда
						ДанныеЗаписи.Режим = "Удалить";
					Иначе
						ДанныеЗаписи.Режим = "Добавить";
					КонецЕсли;
				Иначе
					Если Выборка.ОчиститьАтрибуты Тогда
						Если Не Выборка.ЕстьЗначениеПользователя Тогда
							ДанныеЗаписи.Режим = "Добавить";
						КонецЕсли;
					ИначеЕсли Выборка.ЕстьЗначение И Выборка.ЕстьЗначениеПользователя Тогда
						ДанныеЗаписи.Режим = "Удалить";
					ИначеЕсли Не Выборка.ЕстьЗначение И Не Выборка.ЕстьЗначениеПользователя Тогда
						ДанныеЗаписи.Режим = "Добавить";
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если Выборка.КаждомуВидуПродукцииСоответствуетОдноЗначение Тогда
					Если Выборка.ЕстьЗначение Тогда
						ДанныеЗаписи.Режим = "Добавить";
						ДанныеЗаписи.Значение = Выборка.ТекущееЗначениеЭлемента;
						ДанныеЗаписи.ПометкаУдаления = Истина;
					Иначе
						ДанныеЗаписи.Режим = "Удалить";
					КонецЕсли;
				Иначе
					Если Выборка.ОчиститьАтрибуты
						И Выборка.ЕстьЗначениеПользователя Тогда
						ДанныеЗаписи.Режим = "Удалить";
					ИначеЕсли Выборка.ЕстьЗначение Тогда
						ДанныеЗаписи.Режим = "Добавить";
						ДанныеЗаписи.Значение = Выборка.ТекущееЗначениеЭлемента;
						ДанныеЗаписи.ПометкаУдаления = Истина;
					Иначе
						ДанныеЗаписи.Режим = "Удалить";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеЗаписи.Режим <> Неопределено Тогда
				НаборЗаписей = РегистрыСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЭлементКонструктора.Установить(Выборка.ЭлементКонструктора);
				НаборЗаписей.Отбор.ВидПродукции.Установить(Выборка.ВидПродукции);
				Если Выборка.Параметризуется
					И Не Выборка.КаждомуВидуПродукцииСоответствуетОдноЗначение Тогда
					НаборЗаписей.Отбор.Значение.Установить(ДанныеЗаписи.Значение);
				КонецЕсли;
				Если ДанныеЗаписи.Режим = "Добавить" Тогда
					Запись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка,, "Значение");
					Запись.Значение = ДанныеЗаписи.Значение;
					Запись.ПометкаУдаления = ДанныеЗаписи.ПометкаУдаления;
				КонецЕсли;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
